patodelao/esp32_mini_tool/esp8266_sensor/src/main.cpp
// Nodo sensor ESP8266 (NodeMCU v3) - aire (DHT22) + suelo (HW-103) + WiFi + MQTT.
//
// Publica al broker del home-lab siguiendo las convenciones del minitool,
// para aparecer solo en sus tools Sensores y Nodos:
//
//   labo/sensor/<NODE_ID>/temp   -> temperatura aire, C, texto     [retain]
//   labo/sensor/<NODE_ID>/hum    -> humedad aire, %, texto          [retain]
//   labo/sensor/<NODE_ID>/suelo  -> humedad suelo, %, texto          [retain]
//   labo/nodo/<NODE_ID>/status   -> "online" / "offline"            [retain]
//
// Riego (umbral configurado desde la UI del minitool):
//   labo/config/<NODE_ID>/suelo/umbral      <- umbral % (retenido); 0 = no vigilar
//   labo/config/<NODE_ID>/suelo/histeresis  <- margen % de recuperacion (retenido)
//   labo/alerta/<NODE_ID>                   -> alerta JSON si el suelo esta seco
//
// El nodo alerta por su cuenta (aunque el minitool este apagado): confirma con
// varias lecturas seguidas, usa histeresis para no oscilar, y repite el aviso
// cada 30 min mientras siga seco. Tambien avisa si la sonda parece desconectada.
//
// El estado usa Last-Will (LWT): si el nodo cae, el broker publica "offline".
//
// Sensores (ambos opcionales via ENABLE_* mas abajo):
//   - Aire:  AM2302 (DHT22) en modulo 140C80 -> digital en D2 (GPIO4).
//   - Suelo: sonda resistiva de 2 patas + modulo HW-103 -> analogico en A0.
//            Usamos la salida A0 del modulo (D0 es solo umbral on/off).
//
// Conexionado (NodeMCU v3):
//   DHT22  VCC->3V3   GND->GND   DATA->D2
//   HW-103 VCC->D5    GND->GND   A0 (del modulo)->A0 (del NodeMCU)
//          (VCC en D5, no en 3V3: el nodo enciende la sonda solo al medir)
//   (NO usar VU/VIN=5V para nada: el GPIO/ADC del ESP8266 es de 3.3V)
//
// OJO sensor de suelo resistivo: se corroe si esta siempre energizado. Por eso
// SUELO_VCC_PIN permite alimentarlo desde un GPIO y encenderlo solo un instante
// antes de medir (ver mas abajo; necesita mover un cable).
//
// Nodo pensado para quedar instalado y NO volver a tocarse fisicamente:
//   - OTA: se reflashea por WiFi (pio run -t upload --upload-port <ip>).
//   - Telemetria: publica rssi / uptime / heap como sensores mas del minitool.
//   - Comandos: escucha labo/nodo/<NODE_ID>/cmd (leer, reset, cal on|off).
//   - Reconexion no bloqueante y reinicio de rescate si se queda sin red.

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ArduinoOTA.h>
#include <PubSubClient.h>
#include <DHT.h>
#include <IRremoteESP8266.h>
#include <IRsend.h>

// --- Configuracion: EDITAR ANTES DE FLASHEAR -------------------------------
//
// Las credenciales NO van aca: viven en secrets.ini (ignorado por git) y
// PlatformIO las inyecta como -D al compilar. Copia secrets.ini.example a
// secrets.ini y completa el tuyo. Los valores de abajo son solo el respaldo
// para que el archivo compile si alguien lo abre suelto, y no sirven para
// conectarse a nada.
#ifndef WIFI_SSID
#define WIFI_SSID     "cambiame"
#endif
#ifndef WIFI_PASSWORD
#define WIFI_PASSWORD "cambiame"
#endif

// Identificador del nodo (sin espacios ni '/'). Aparece como labo/nodo/<NODE_ID>
// y labo/sensor/<NODE_ID>/... en las tools del minitool.
#define NODE_ID       "pieza"

// Sensores activos (1 = si, 0 = no). Por defecto ambos; pon uno en 0 para un
// nodo solo-aire o solo-suelo sin tocar mas codigo.
#define ENABLE_DHT    1     // aire: DHT22 en D2 -> temp + hum
#define ENABLE_SUELO  1     // suelo: modulo HW-103 en A0

// Clave para actualizar por WiFi (OTA). Tambien viene de secrets.ini.
#ifndef OTA_PASSWORD
#define OTA_PASSWORD  "cambiame"
#endif

// --- Hardware --------------------------------------------------------------
#define DHT_PIN   D2        // GPIO4
#define DHT_TYPE  DHT22     // AM2302 = DHT22
#define SUELO_PIN A0        // unica entrada analogica del ESP8266

// IR: LED infrarrojo (via 2N2222) para apagar la TV Samsung por comando MQTT.
// D1 (GPIO5) esta libre y es seguro (sin restricciones de boot). Va a la BASE
// del transistor a traves de Rb; el LED IR lo maneja el colector (ver README).
#define IR_PIN            D1          // GPIO5 -> base del 2N2222
#define SAMSUNG_POWER_OFF 0xE0E019E6  // apagado DISCRETO (siempre OFF, no toggle)

// Alimentacion de la sonda de suelo. La sonda resistiva se CORROE si esta
// siempre energizada (dura semanas en vez de meses). Si mueves el VCC del
// modulo HW-103 de 3V3 al pin D5, pon aqui 14 y el nodo lo enciende solo el
// instante de medir.
//   -1 = sonda siempre alimentada (cableado original)
//   14 = alimentada solo al medir, cable VCC en D5 (recomendado)
// Va el numero de GPIO, no "D5": esto lo evalua el preprocesador.
// Ojo: si el modulo trae LED de encendido puede pasar de los ~12 mA que da un
// GPIO; en ese caso desuelda el LED o usa un transistor pequeno.
//
// ESTA EN 14: el VCC del modulo HW-103 TIENE que ir a D5. Si lo dejas en 3V3,
// la sonda queda sin alimentar al medir y el nodo avisa "sonda sin
// alimentacion" (ver SUELO_RAW_MINIMO) en vez de inventar un 100 % de humedad.
#define SUELO_VCC_PIN   14
#define SUELO_ESTABILIZAR_MS  300   // espera tras energizar, antes de leer

// Calibracion del suelo (valor crudo del ADC, 0..1023). En el HW-103 resistivo:
//   seco -> lectura ALTA     en agua -> lectura BAJA
//
// SECO_RAW conviene medirlo con la sonda en TIERRA SECA, no al aire. Al aire la
// lectura se va al tope del ADC (1023) y eso trae dos problemas: se desperdicia
// escala (la tierra seca real nunca llega ahi, asi que los % quedan comprimidos)
// y encima no queda margen para distinguir "tierra seca" de "sonda al aire", que
// es justo lo que necesita SUELO_RAW_DESCONECTADO.
//
// Medidos por el usuario: en agua 520, al aire 1023.
#define SUELO_SECO_RAW  1023
#define SUELO_AGUA_RAW  520

// Deteccion de sonda en falla. Los dos umbrales se DERIVAN de la calibracion:
// si se fijan a mano es facil que se solapen con las lecturas normales y el
// nodo confunda tierra seca con sonda rota (deja de publicar y no te enteras).
//
// Arriba de seco + margen: sonda al aire o cable de senal suelto.
// Ojo: si SUELO_SECO_RAW esta pegado al tope del ADC (o sea, sin calibrar),
// este chequeo queda inalcanzable a proposito: sin calibrar no hay forma de
// distinguir "tierra muy seca" de "sonda al aire", y equivocarse hacia el lado
// de callarse es peor que publicar.
#define SUELO_RAW_DESCONECTADO  (SUELO_SECO_RAW + 8 > 1023 ? 1024 : SUELO_SECO_RAW + 8)

// Por DEBAJO de este crudo tampoco hay medida valida: ni la tierra empapada
// baja tanto (por eso se calcula desde el crudo en agua). Casi siempre
// significa que la sonda no esta recibiendo tension (VCC no quedo en D5, ver
// SUELO_VCC_PIN) o que hay un corto. Sin este chequeo se reportaria un 100 %
// de humedad falso, justo lo contrario de la realidad.
#define SUELO_RAW_MINIMO  (SUELO_AGUA_RAW / 4)

// Modo calibracion/diagnostico: imprime el crudo del ADC cada segundo (ademas
// del ciclo normal de 10 s), para ajustar los dos valores de arriba y para
// revisar cableado moviendo cables en vivo. Es el valor INICIAL: ya instalado
// se enciende y apaga a distancia con el comando "cal on" / "cal off".
#define CALIBRAR_SUELO  0

// Limpieza puntual tras renombrar el nodo: publica un payload VACIO retenido en
// los topics del id anterior para borrar sus mensajes retenidos del broker, y
// que no queden sensores fantasma en el minitool. Ya se corrio con id "sala",
// asi que queda en 0.
#define LIMPIAR_TOPICS_VIEJOS  0
#define ID_VIEJO               "sala"

// --- MQTT ------------------------------------------------------------------
// Broker primario del home-lab: la Mosquitto de la Raspberry Pi.
//
// Historia: por un tiempo el primario fue el refri (opendoor, .108) con broker
// embebido, para no depender de la Pi. Se revirtio (2026-09): el refri resulto
// ser el punto unico de falla (con el refri caido, TODA la flota se queda sin
// broker) y hoy el centro es la Pi, donde viven Home Assistant, el monitor y
// el push.
//
// OJO: la Pi NO tiene reserva DHCP, su IP se mueve (era .100, hoy .99). Si el
// nodo deja de publicar, revisa primero si la Pi cambio de IP.
/* El servidor del home-lab es el Mac mini (IP fija en el propio Debian, no una
 * reserva del router). Antes esto apuntaba a la Raspberry Pi (192.168.1.99), que ya no existe:
 * el nodo conectaba al WiFi y nunca al broker, sin ningun error visible. */
#define MQTT_BROKER   "192.168.1.104"
#define MQTT_PORT     1883

