patodelao/esp32_mini_tool/esp8266_sensor/src/main.cpp
// Credenciales del broker. NULL = anonimo (broker sin auth). Para broker con
// password, se definen via build_flags desde secrets.ini (ver platformio.ini).
#ifndef MQTT_USER
#define MQTT_USER NULL
#endif
#ifndef MQTT_PASS
#define MQTT_PASS NULL
#endif

#define TOPIC_STATUS  "labo/nodo/"   NODE_ID "/status"
#define TOPIC_IP      "labo/nodo/"   NODE_ID "/ip"    /* para poder actualizarlo por OTA */
#define TOPIC_TEMP    "labo/sensor/" NODE_ID "/temp"
#define TOPIC_HUM     "labo/sensor/" NODE_ID "/hum"
#define TOPIC_SUELO   "labo/sensor/" NODE_ID "/suelo"
#define TOPIC_RSSI    "labo/sensor/" NODE_ID "/rssi"    /* salud: senal WiFi   */
#define TOPIC_UPTIME  "labo/sensor/" NODE_ID "/uptime"  /* salud: minutos on   */
#define TOPIC_HEAP    "labo/sensor/" NODE_ID "/heap"    /* salud: RAM libre kB */
#define TOPIC_SUELO_RAW "labo/sensor/" NODE_ID "/suelo_raw"       /* crudo del ADC, solo en calibracion */
#define TOPIC_UMBRAL  "labo/config/" NODE_ID "/suelo/umbral"      /* config del minitool (retenido) */
#define TOPIC_HISTER  "labo/config/" NODE_ID "/suelo/histeresis"  /* idem */
#define TOPIC_INTERV  "labo/config/" NODE_ID "/suelo/intervalo"   /* idem, en segundos */
#define TOPIC_ALERTA  "labo/alerta/" NODE_ID                      /* bus de alertas del home-lab */
#define TOPIC_CMD     "labo/nodo/"   NODE_ID "/cmd"               /* ordenes desde la tool Control */
#define TOPIC_TV      "labo/nodo/"   NODE_ID "/tv"                /* "off" -> apaga la TV por IR */

// Cada cuanto leer y publicar el AIRE. El DHT22 admite 1 lectura / 2 s.
static const unsigned long PUBLICAR_MS = 10000;

// El SUELO tiene su propio ritmo, que se ajusta desde el minitool (TOPIC_INTERV)
// porque la humedad de la tierra cambia en horas, no en segundos: medir cada
// varios minutos alcanza, energiza menos la sonda y ahorra trafico. Este es el
// valor por defecto hasta que llegue la config retenida.
#define SUELO_INTERVALO_DEF_S   10
#define SUELO_INTERVALO_MIN_S    5
#define SUELO_INTERVALO_MAX_S 3600

// El modo calibracion publica el crudo del ADC (para poder recalibrar sin
// desmontar el nodo) y se apaga solo, para no dejarlo publicando de mas.
static const unsigned long CALIBRAR_MAX_MS = 30UL * 60UL * 1000UL;

// La telemetria de salud cambia lento: cada minuto sobra.
static const unsigned long TELEMETRIA_MS = 60000;

// Si pasa este rato sin WiFi, reiniciar: barato y saca al nodo de estados
// raros de la pila de red sin que tengas que ir a desenchufarlo.
static const unsigned long RESCATE_MS = 15UL * 60UL * 1000UL;

// Riego: valores por defecto hasta que llegue la config retenida del minitool.
#define SUELO_UMBRAL_DEF   20.0f   /* % por debajo del cual el suelo esta seco  */
#define SUELO_HISTER_DEF    5.0f   /* margen de recuperacion, para no oscilar   */

// Lecturas seguidas necesarias para dar por buena la condicion. A 10 s por
// ciclo son 30 s: filtra picos del ADC sin retrasar de mas el aviso.
#define SUELO_CONFIRMAR     3

// Cada cuanto repetir el aviso mientras el suelo siga seco (recordatorio).
static const unsigned long REAVISO_MS = 30UL * 60UL * 1000UL;

// --- Objetos globales ------------------------------------------------------
#if ENABLE_DHT
DHT dht(DHT_PIN, DHT_TYPE);
#endif
WiFiClient   wifiClient;
PubSubClient mqtt(wifiClient);
IRsend       irsend(IR_PIN);                 // emisor IR (apagado de la TV)
static volatile bool s_apagar_tv = false;    // flag: enviar el codigo IR en el loop
static volatile bool s_test_led  = false;    // flag: parpadeo largo de prueba de cableado

static unsigned long ultimaPublicacion = 0;   // aire
static unsigned long ultimaTelemetria  = 0;
static unsigned long ultimoSuelo       = 0;
static char clientId[32];   // se arma con el chip id para ser unico en el broker

static bool          s_calibrar   = (CALIBRAR_SUELO != 0);  // se cambia por MQTT
static unsigned long s_calibrarMs = 0;      // cuando se encendio la calibracion
static unsigned long s_sinWifiMs  = 0;      // millis del ultimo momento con WiFi
static unsigned long s_proxMqtt   = 0;      // cuando reintentar conectar al broker
static unsigned long s_esperaMqtt = 3000;   // backoff del reintento

#if ENABLE_SUELO
static float s_umbral_suelo = SUELO_UMBRAL_DEF;  // % de riego (lo pisa el minitool)
static float s_hister_suelo = SUELO_HISTER_DEF;  // margen de recuperacion
static unsigned long s_suelo_ms = SUELO_INTERVALO_DEF_S * 1000UL;  // ritmo de medicion
static bool  s_suelo_seco   = false;             // estado con histeresis
static int   s_seco_n       = 0;                 // lecturas seguidas confirmando
static int   s_humedo_n     = 0;
static unsigned long s_ultimo_aviso = 0;         // para el recordatorio
static bool  s_sonda_ko     = false;             // sonda al aire / desconectada
static int   s_sonda_ko_n   = 0;
static unsigned long s_sonda_ko_ms = 0;          // para repetir el aviso
#endif

// Parpadeo corto del LED integrado (GPIO2, activo en bajo) como senal de vida.
static void parpadeo() {
  digitalWrite(LED_BUILTIN, LOW);
  delay(20);
  digitalWrite(LED_BUILTIN, HIGH);
}

// Publica una alerta JSON en el bus del home-lab (el minitool la muestra).
static void publicar_alerta(const char *nivel, const char *msg) {
  char payload[128];
  snprintf(payload, sizeof(payload),
           "{\"origen\":\"Pieza\",\"nivel\":\"%s\",\"msg\":\"%s\"}", nivel, msg);
  mqtt.publish(TOPIC_ALERTA, payload);
}

#if ENABLE_SUELO
// Mediana de varias lecturas del ADC. Mejor que el promedio para este sensor:
// un pico aislado (ruido de la fuente, cable largo) no arrastra el resultado.
static int leer_suelo_raw() {
  const int N = 9;
  int v[N];

  // Con SUELO_VCC_PIN la sonda solo se energiza para esta medicion (menos
  // corrosion). Necesita un momento para estabilizarse antes de leer.
#if SUELO_VCC_PIN >= 0
  digitalWrite(SUELO_VCC_PIN, HIGH);
  delay(SUELO_ESTABILIZAR_MS);
#endif

  for (int i = 0; i < N; i++) { v[i] = analogRead(SUELO_PIN); delay(5); }

#if SUELO_VCC_PIN >= 0
  digitalWrite(SUELO_VCC_PIN, LOW);
#endif

  for (int i = 1; i < N; i++) {            // insercion: N es chico
    int x = v[i], j = i - 1;
    while (j >= 0 && v[j] > x) { v[j + 1] = v[j]; j--; }
    v[j + 1] = x;
  }
  return v[N / 2];
}

// Convierte el crudo a % de humedad (0 = seco, 100 = saturado), con recorte.
static float suelo_pct(int raw) {
  float pct = 100.0f * (float)(SUELO_SECO_RAW - raw) /
                       (float)(SUELO_SECO_RAW - SUELO_AGUA_RAW);
  if (pct < 0)   pct = 0;
  if (pct > 100) pct = 100;
  return pct;
}

// Avisa si el crudo cae fuera de lo fisicamente posible: pegado al tope (sonda
// al aire o cable suelto) o al piso (sin alimentacion / corto). En ambos casos
// el % que saldria seria una falsa alarma, en un sentido o en el otro.
static bool revisar_sonda(int raw) {
  if (raw >= SUELO_RAW_DESCONECTADO || raw <= SUELO_RAW_MINIMO) {
    bool sin_tension = (raw <= SUELO_RAW_MINIMO);
    const char *que = sin_tension ? "Sonda de suelo sin alimentacion"
                                  : "Sonda de suelo desconectada o al aire";
    unsigned long ahora = millis();
    if (++s_sonda_ko_n >= SUELO_CONFIRMAR && !s_sonda_ko) {
      s_sonda_ko = true;
      s_sonda_ko_ms = ahora;
      publicar_alerta("alarma", que);
      Serial.printf("ALERTA: sonda de suelo %s (raw %d)\n",
                    sin_tension ? "sin alimentacion" : "desconectada", raw);
    } else if (s_sonda_ko && ahora - s_sonda_ko_ms >= REAVISO_MS) {
      // Mientras la sonda este en falla no se publica humedad, asi que el aviso
      // se repite: si no, un solo toast perdido y el riego queda ciego sin que
      // nada lo recuerde.
      s_sonda_ko_ms = ahora;
      publicar_alerta("alarma", que);
      Serial.printf("RECORDATORIO: sonda de suelo %s (raw %d)\n",
                    sin_tension ? "sin alimentacion" : "desconectada", raw);
    }
  } else {
    s_sonda_ko_n = 0;
    if (s_sonda_ko) {
      s_sonda_ko = false;
      publicar_alerta("ok", "Sonda de suelo conectada");
      Serial.println("Sonda de suelo de vuelta");
    }
  }
  return s_sonda_ko;
}

// Chequea el umbral y publica alerta al bus. Para no spamear ni oscilar:
//   - exige SUELO_CONFIRMAR lecturas seguidas antes de cambiar de estado,
//   - la vuelta a normal pide superar el umbral + histeresis,
//   - mientras siga seco, repite el aviso cada REAVISO_MS.
static void revisar_umbral_suelo(float pct) {
  if (s_umbral_suelo <= 0.0f) return;   // vigilancia desactivada desde la UI

  char msg[80];
  unsigned long ahora = millis();

  if (!s_suelo_seco) {
    if (pct < s_umbral_suelo) s_seco_n++;
    else                      s_seco_n = 0;

    if (s_seco_n >= SUELO_CONFIRMAR) {
      s_suelo_seco = true;
      s_seco_n = 0;
      s_ultimo_aviso = ahora;
      snprintf(msg, sizeof(msg), "Suelo seco %.0f%% (umbral %.0f%%)", pct, s_umbral_suelo);
      publicar_alerta("aviso", msg);
      Serial.printf("ALERTA: %s\n", msg);
    }
    return;
  }

  // Ya estaba seco: ver si se recupero, y si no, recordarlo cada tanto.
  if (pct > s_umbral_suelo + s_hister_suelo) s_humedo_n++;
  else                                       s_humedo_n = 0;

  if (s_humedo_n >= SUELO_CONFIRMAR) {
    s_suelo_seco = false;
    s_humedo_n = 0;
    snprintf(msg, sizeof(msg), "Suelo recuperado %.0f%%", pct);
    publicar_alerta("ok", msg);
    Serial.printf("%s\n", msg);
  } else if (ahora - s_ultimo_aviso >= REAVISO_MS) {
    s_ultimo_aviso = ahora;
    snprintf(msg, sizeof(msg), "Sigue seco %.0f%% (umbral %.0f%%)", pct, s_umbral_suelo);
    publicar_alerta("aviso", msg);
    Serial.printf("RECORDATORIO: %s\n", msg);
  }
}
#endif

// --- Callback MQTT: config del minitool + comandos remotos ------------------
//
// Comandos en labo/nodo/<NODE_ID>/cmd (los manda la tool Control):
//   "leer"     -> publica una lectura ahora, sin esperar el ciclo
//   "reset"    -> reinicia el nodo
//   "cal on"   -> empieza a imprimir el crudo del ADC por serie
//   "cal off"  -> deja de imprimirlo
static void on_mqtt(char *topic, byte *payload, unsigned int len) {
  char b[24];
  unsigned int n = len < sizeof(b) - 1 ? len : sizeof(b) - 1;
  memcpy(b, payload, n);
  b[n] = '\0';

  if (strcmp(topic, TOPIC_TV) == 0) {
    // Solo levantamos el flag: el pulso IR (~70ms) se envia en el loop, no
    // aca dentro (que corre desde mqtt.loop()), para no alargar el callback.
    if (strncmp(b, "off", 3) == 0) {
      s_apagar_tv = true;
      Serial.println("TV: pedido de apagado por IR");
    } else if (strncmp(b, "test", 4) == 0) {
      s_test_led = true;
      Serial.println("TV: prueba de cableado (parpadeo largo)");
    }
    return;
  }

  if (strcmp(topic, TOPIC_CMD) == 0) {
    Serial.printf("CMD: %s\n", b);
    if (strcmp(b, "leer") == 0) {
      ultimaPublicacion = 0;              // el loop publica en el proximo giro
      ultimoSuelo       = 0;
    } else if (strcmp(b, "reset") == 0 || strcmp(b, "reiniciar") == 0) {
      publicar_alerta("ok", "Reiniciando el nodo");
      mqtt.loop();                        // dale tiempo a salir antes del reset
      delay(200);
      ESP.restart();
    } else if (strcmp(b, "cal on") == 0) {
      s_calibrar   = true;
      s_calibrarMs = millis();
      Serial.println("Calibracion ON: publicando el crudo del ADC");
    } else if (strcmp(b, "cal off") == 0) {
      s_calibrar = false;
      Serial.println("Calibracion OFF");
    }
    return;
  }

