patodelao/esp32_mini_tool/esp8266_sensor/src/main.cpp
#if ENABLE_SUELO
  float v = strtof(b, NULL);
  if (strcmp(topic, TOPIC_UMBRAL) == 0) {
    // 0 = el minitool apago el limite bajo: dejamos de vigilar aqui.
    if (v >= 0.0f && v <= 100.0f) {
      s_umbral_suelo = v;
      s_seco_n = s_humedo_n = 0;
      Serial.printf("Umbral de suelo actualizado: %.0f %%%s\n",
                    s_umbral_suelo, s_umbral_suelo <= 0.0f ? " (sin vigilancia)" : "");
    }
  } else if (strcmp(topic, TOPIC_HISTER) == 0) {
    if (v >= 0.0f && v <= 50.0f) {
      s_hister_suelo = v;
      Serial.printf("Histeresis de suelo actualizada: %.0f %%\n", s_hister_suelo);
    }
  } else if (strcmp(topic, TOPIC_INTERV) == 0) {
    if (v >= SUELO_INTERVALO_MIN_S && v <= SUELO_INTERVALO_MAX_S) {
      s_suelo_ms = (unsigned long)v * 1000UL;
      Serial.printf("Intervalo de suelo actualizado: %lu s\n", s_suelo_ms / 1000UL);
    }
  }
#endif
}

// --- Conectividad (no bloqueante) ------------------------------------------
//
// Nada de while(!conectado): el loop tiene que seguir girando para atender OTA
// aunque el broker este caido. Si se cae la red, el nodo publica igual apenas
// vuelve, y si no vuelve en RESCATE_MS se reinicia solo.

static void wifiIniciar() {
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);        // no desgastar la flash guardando credenciales
  WiFi.setAutoReconnect(true);
  WiFi.hostname(NODE_ID);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.printf("WiFi: conectando a \"%s\"...\n", WIFI_SSID);
}

static void wifiMantener() {
  if (WiFi.status() == WL_CONNECTED) {
    if (s_sinWifiMs) {           // acabamos de recuperarla
      Serial.printf("WiFi: conectado. IP %s  RSSI %d dBm\n",
                    WiFi.localIP().toString().c_str(), WiFi.RSSI());
      s_sinWifiMs = 0;
    }
    return;
  }

  unsigned long ahora = millis();
  if (!s_sinWifiMs) {
    s_sinWifiMs = ahora ? ahora : 1;   // 0 esta reservado para "hay WiFi"
    Serial.println("WiFi: caida, reintentando en segundo plano");
  } else if (ahora - s_sinWifiMs >= RESCATE_MS) {
    Serial.println("WiFi: sin red hace rato, reiniciando el nodo");
    delay(100);
    ESP.restart();
  }
}

// Se suscribe y saluda; se llama en cada (re)conexion al broker.
static void mqttAlConectar() {
  Serial.println("MQTT: conectado");
  mqtt.publish(TOPIC_STATUS, "online", true);
  // La IP queda retenida y visible en la tool Nodos: es la que se le pasa al
  // OTA cuando el nombre mDNS no resuelve (pasa seguido en Windows).
  mqtt.publish(TOPIC_IP, WiFi.localIP().toString().c_str(), true);
#if LIMPIAR_TOPICS_VIEJOS
  /* Payload vacio + retain = borra el mensaje retenido en el broker. */
  mqtt.publish("labo/sensor/" ID_VIEJO "/temp",   "", true);
  mqtt.publish("labo/sensor/" ID_VIEJO "/hum",    "", true);
  mqtt.publish("labo/sensor/" ID_VIEJO "/suelo",  "", true);
  mqtt.publish("labo/nodo/"   ID_VIEJO "/status", "", true);
  Serial.println("Limpieza: borrados los retenidos de '" ID_VIEJO "'");
#endif
  mqtt.subscribe(TOPIC_CMD);      // ordenes desde la tool Control
  mqtt.subscribe(TOPIC_TV);       // apagado de la TV por IR
#if ENABLE_SUELO
  mqtt.subscribe(TOPIC_UMBRAL);   // config de riego del minitool (retenida)
  mqtt.subscribe(TOPIC_HISTER);
  mqtt.subscribe(TOPIC_INTERV);
#endif
}

static void mqttMantener() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (mqtt.connected()) { s_esperaMqtt = 3000; return; }

  unsigned long ahora = millis();
  if (s_proxMqtt && ahora - s_proxMqtt < s_esperaMqtt) return;
  s_proxMqtt = ahora ? ahora : 1;

  Serial.printf("MQTT: conectando a %s:%d como %s ...\n",
                MQTT_BROKER, MQTT_PORT, clientId);
  // connect(id, user, pass, willTopic, willQoS, willRetain, willMessage): el LWT
  // deja "offline" retenido si el nodo se desconecta sin avisar. user/pass NULL
  // = anonimo (compatible con el broker sin auth).
  if (mqtt.connect(clientId, MQTT_USER, MQTT_PASS, TOPIC_STATUS, 1, true, "offline")) {
    mqttAlConectar();
    s_esperaMqtt = 3000;
  } else {
    // Backoff: si el broker esta caido, no lo martillamos cada 3 s.
    s_esperaMqtt = s_esperaMqtt < 60000 ? s_esperaMqtt * 2 : 60000;
    Serial.printf("MQTT: fallo (rc=%d), reintento en %lu s\n",
                  mqtt.state(), s_esperaMqtt / 1000);
  }
}

// --- OTA: actualizar por WiFi, sin desmontar el nodo ------------------------
static void otaIniciar() {
  ArduinoOTA.setHostname(NODE_ID);
  ArduinoOTA.setPassword(OTA_PASSWORD);
  ArduinoOTA.onStart([]() {
    Serial.println("OTA: recibiendo firmware nuevo");
    if (mqtt.connected()) {
      publicar_alerta("aviso", "Actualizando firmware por OTA");
      mqtt.loop();
    }
  });
  ArduinoOTA.onEnd([]() { Serial.println("\nOTA: listo, reiniciando"); });
  ArduinoOTA.onError([](ota_error_t e) { Serial.printf("OTA: error %u\n", e); });
  ArduinoOTA.begin();
  Serial.println("OTA: activo (pio run -e " NODE_ID "_ota -t upload)");
}

// --- Telemetria de salud ----------------------------------------------------
// Se publica como sensores normales, asi el minitool ya los grafica, guarda su
// record del dia y les aplica umbrales (p.ej. avisar si el WiFi baja de -85 dBm).
static void publicarTelemetria() {
  char buf[16];

  snprintf(buf, sizeof(buf), "%d", WiFi.RSSI());
  mqtt.publish(TOPIC_RSSI, buf, true);

  snprintf(buf, sizeof(buf), "%lu", millis() / 60000UL);
  mqtt.publish(TOPIC_UPTIME, buf, true);

  snprintf(buf, sizeof(buf), "%.1f", ESP.getFreeHeap() / 1024.0f);
  mqtt.publish(TOPIC_HEAP, buf, true);

  Serial.printf("Salud -> RSSI %d dBm   uptime %lu min   heap %.1f kB\n",
                WiFi.RSSI(), millis() / 60000UL, ESP.getFreeHeap() / 1024.0f);
}

static void publicarAire() {
#if ENABLE_DHT
  char buf[16];
  float humedad = dht.readHumidity();
  float tempC   = dht.readTemperature();
  if (isnan(humedad) || isnan(tempC)) {
    Serial.println("[ERROR] lectura DHT22 fallida (revisa cableado/pin D2)");
  } else {
    snprintf(buf, sizeof(buf), "%.1f", tempC);
    mqtt.publish(TOPIC_TEMP, buf, true);
    snprintf(buf, sizeof(buf), "%.1f", humedad);
    mqtt.publish(TOPIC_HUM, buf, true);
    Serial.printf("Aire  -> T: %.1f C   HR: %.1f %%\n", tempC, humedad);
  }
#endif
  parpadeo();
}

static void publicarSuelo() {
#if ENABLE_SUELO
  char buf[16];
  int raw = leer_suelo_raw();
  float pct = suelo_pct(raw);
  bool sonda_ko = revisar_sonda(raw);

  // Con la sonda en falla no publicamos el % (seria un valor enganoso que
  // dispararia una alerta de riego al reves de la realidad).
  if (!sonda_ko) {
    snprintf(buf, sizeof(buf), "%.0f", pct);
    mqtt.publish(TOPIC_SUELO, buf, true);
    revisar_umbral_suelo(pct);
  }

  // En calibracion el crudo tambien va por MQTT: asi se recalibra mirando el
  // minitool, sin cable USB ni monitor serie.
  if (s_calibrar) {
    snprintf(buf, sizeof(buf), "%d", raw);
    mqtt.publish(TOPIC_SUELO_RAW, buf, false);
  }

  Serial.printf("Suelo -> %.0f %% (raw %d)%s\n", pct, raw, sonda_ko ? "  [sonda KO]" : "");
#endif
}

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println();
  Serial.println("=== ESP8266 sensor: aire (DHT22) + suelo (HW-103) + MQTT ===");
  Serial.printf("Nodo: %s\n", NODE_ID);
#if ENABLE_DHT
  Serial.printf("  aire  -> %s | %s (D2)\n", TOPIC_TEMP, TOPIC_HUM);
#endif
#if ENABLE_SUELO
  Serial.printf("  suelo -> %s (A0)\n", TOPIC_SUELO);
#endif

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, HIGH);  // apagado

#if ENABLE_SUELO && SUELO_VCC_PIN >= 0
  pinMode(SUELO_VCC_PIN, OUTPUT);
  digitalWrite(SUELO_VCC_PIN, LOW); // sonda apagada salvo al medir
  Serial.println("  sonda de suelo alimentada por GPIO (anti-corrosion)");
#endif

#if ENABLE_DHT
  dht.begin();
#endif

  irsend.begin();   // emisor IR para el apagado de la TV

