patodelao/esp32_mini_tool/esp8266_sensor/src/main.cpp
  // Client id unico en el broker publico (compartido con todo internet).
  snprintf(clientId, sizeof(clientId), "esp8266-%s-%06X", NODE_ID, ESP.getChipId());

  mqtt.setServer(MQTT_BROKER, MQTT_PORT);
  mqtt.setCallback(on_mqtt);

  wifiIniciar();

  // Espera acotada solo para que el primer arranque se vea completo por serie;
  // si la red no esta, seguimos igual y el loop se encarga.
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 15000) {
    delay(250);
    Serial.print('.');
  }
  Serial.println();

  otaIniciar();
  wifiMantener();
  mqttMantener();
}

void loop() {
  wifiMantener();
  mqttMantener();
  ArduinoOTA.handle();   // atiende una actualizacion por WiFi si llega
  mqtt.loop();

  // Apagado de la TV por IR: se pidio desde MQTT (on_mqtt levanto el flag). El
  // pulso Samsung dura ~70ms; se dispara aca, no en el callback, y no molesta a
  // los sensores (que miden cada 10s+). No hace falta una task tipo ESP32.
  if (s_apagar_tv) {
    s_apagar_tv = false;
    // Enviamos el codigo 3 veces con pausas cortas: a ~4m el receptor de la TV
    // puede perder un pulso. Como es apagado DISCRETO (no toggle), repetir es
    // seguro: nunca la vuelve a prender. ~3 x 70ms = ~0.3s, invisible para los
    // sensores (que miden cada 10s).
    for (int i = 0; i < 3; i++) {
      irsend.sendSAMSUNG(SAMSUNG_POWER_OFF, 32);
      delay(40);
    }
    Serial.println("IR: apagado Samsung enviado x3 (0xE0E019E6)");
  }

  // Prueba de CABLEADO (no es la señal real): parpadeo LARGO y visible a ojo o
  // camara, para confirmar que GPIO -> transistor -> LED conmuta. Pulsos de
  // 250ms x6: seguros para el LED IR (son pulsos, no DC continuo que lo
  // sobrecalentaria). Bloquea ~3s, pero es una prueba manual puntual.
  if (s_test_led) {
    s_test_led = false;
    Serial.println("IR: parpadeo de prueba (6 x 250ms) -- mira el LED/camara");
    for (int i = 0; i < 6; i++) {
      digitalWrite(IR_PIN, HIGH); delay(250);
      digitalWrite(IR_PIN, LOW);  delay(250);
    }
  }

  unsigned long ahora = millis();

#if ENABLE_SUELO
  // La calibracion se apaga sola: es un modo de diagnostico, no un estado
  // normal (mide y publica seguido, y energiza la sonda cada segundo).
  if (s_calibrar && ahora - s_calibrarMs >= CALIBRAR_MAX_MS) {
    s_calibrar = false;
    Serial.println("Calibracion OFF (por tiempo)");
  }
#endif

  if (mqtt.connected()) {
    if (ahora - ultimaPublicacion >= PUBLICAR_MS) {
      ultimaPublicacion = ahora;
      publicarAire();
    }
#if ENABLE_SUELO
    // En calibracion se mide cada segundo para poder ajustar mirando el valor
    // en vivo; el resto del tiempo, al ritmo configurado desde el minitool.
    unsigned long cada = s_calibrar ? 1000UL : s_suelo_ms;
    if (ahora - ultimoSuelo >= cada) {
      ultimoSuelo = ahora;
      publicarSuelo();
    }
#endif
    if (ahora - ultimaTelemetria >= TELEMETRIA_MS) {
      ultimaTelemetria = ahora;
      publicarTelemetria();
    }
  }
}
